ascend_test_suite/logs/performance/000000/20260915_dsv4-dspark_DynamicSplitFuseV2.log
========================================================
Random Testing input=64K, output=1K
========================================================
Testing concurrency=8, prompts=8
PREFIX_LEN=55680 SUFFIX_LEN=9856 BENCH_NUM_PROMPTS=64 /workspace/cmd/bench-vllm-prefix.sh 64K 8
INFO 09-15 06:30:01 [__init__.py:52] Available plugins for group vllm.platform_plugins:
INFO 09-15 06:30:01 [__init__.py:54] - ascend -> vllm_ascend:register
INFO 09-15 06:30:01 [__init__.py:57] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 09-15 06:30:01 [__init__.py:237] Platform plugin ascend is activated
INFO 09-15 06:30:01 [platform.py:61] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
INFO 09-15 06:30:16 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 09-15 06:30:16 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xffff09f237e0>, trust_remote_code=True, seed=20260800, num_prompts=64, dataset_name='prefix_repetition', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=55680, prefix_repetition_suffix_len=9856, prefix_repetition_num_prefixes=1, prefix_repetition_output_len=1024, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:20000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='dsv4-dspark', input_len=None, output_len=None, tokenizer='/home/weight/DeepSeek-V4-Flash-DSpark-w8a8', tokenizer_mode='deepseek_v4', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['experiment=manual', 'run=single', 'input_tag=64K', 'prefix_len=55680', 'suffix_len=9856', 'num_warmups=1'], result_dir='', result_filename='input64K_out1k_c8.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-ed40ff65-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  171.10    
Total input tokens:                      4194305   
Total generated tokens:                  65536     
Request throughput (req/s):              0.37      
Output token throughput (tok/s):         383.02    
Peak output token throughput (tok/s):    136.00    
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          24896.31  
---------------Time to First Token----------------
Mean TTFT (ms):                          2820.84   
Median TTFT (ms):                        2196.47   
P50 TTFT (ms):                           2196.47   
P90 TTFT (ms):                           3868.06   
P95 TTFT (ms):                           6077.75   
P99 TTFT (ms):                           8567.59   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.40     
Median TPOT (ms):                        15.80     
P50 TPOT (ms):                           15.80     
P90 TPOT (ms):                           27.89     
P95 TPOT (ms):                           28.47     
P99 TPOT (ms):                           29.10     
---------------Inter-token Latency----------------
Mean ITL (ms):                           105.70    
Median ITL (ms):                         65.74     
P50 ITL (ms):                            65.74     
P90 ITL (ms):                            158.07    
P95 ITL (ms):                            480.55    
P99 ITL (ms):                            543.66    
---------------Speculative Decoding---------------
Acceptance rate (%):                     72.73     
Acceptance length:                       6.09      
Drafts:                                  10781     
Draft tokens:                            75467     
Accepted tokens:                         54887     
Per-position acceptance (%):
  Position 0:                            93.75     
  Position 1:                            91.36     
  Position 2:                            90.41     
  Position 3:                            65.74     
  Position 4:                            64.13     
  Position 5:                            54.98     
  Position 6:                            48.74     
==================================================